openfoam13/FoamPilotCases/Turning35Foundation13/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
application     marineFoam;
solver          incompressibleVoF;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.20;
deltaT          0.001;
writeControl    adjustableRunTime;
writeInterval   0.01;
purgeWrite      0;
writeFormat     ascii;
writePrecision  10;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable yes;
adjustTimeStep  yes;
maxCo           0.5;
maxAlphaCo      0.25;
maxDeltaT       0.01;
