openfoam13/FoamPilotCases/Turning35Foundation13/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class dictionary;
    object blockMeshDict;
}
convertToMeters 1;
vertices
(
    (-1 -0.5 -0.35) (3.5 -0.5 -0.35) (3.5 0.5 -0.35) (-1 0.5 -0.35)
    (-1 -0.5 0.35) (3.5 -0.5 0.35) (3.5 0.5 0.35) (-1 0.5 0.35)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (90 20 14) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
    inlet { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 2 6 5)); }
    sideA { type symmetryPlane; faces ((0 1 5 4)); }
    sideB { type symmetryPlane; faces ((3 7 6 2)); }
    bottom { type wall; faces ((0 3 2 1)); }
    atmosphere { type patch; faces ((4 5 6 7)); }
);
mergePatchPairs ();
