openfoam13/FoamPilotCases/Turning35Foundation13/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class dictionary;
    location "system";
    object snappyHexMeshDict;
}
castellatedMesh true;
snap true;
addLayers false;
geometry
{
    hull
    {
        type triSurface;
        file "hull.stl";
        regions
        {
            hull_deck { name hull; }
            hull_hull { name hull; }
            hull_shaft { name hull; }
            hull_stern { name hull; }
        }
    }
    rudder
    {
        type triSurface;
        file "rudder.stl";
        regions { rudder { name rudder; } }
    }
    BoxRefinement { type searchableBox; min (-0.85 -0.45 -0.3); max (3.25 0.45 0.3); }
}
castellatedMeshControls
{
    maxLocalCells 2000000;
    maxGlobalCells 4000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3;
    resolveFeatureAngle 30;
    features ();
    refinementSurfaces
    {
        hull { level (1 2); patchInfo { type wall; } }
        rudder { level (1 2); patchInfo { type wall; } }
    }
    refinementRegions
    {
        BoxRefinement { mode inside; levels ((1 1)); }
    }
    locationInMesh (0 0 0.0215);
    allowFreeStandingZoneFaces true;
}
snapControls
{
    nSmoothPatch 3;
    tolerance 2;
    nSolveIter 30;
    nRelaxIter 5;
}
meshQualityControls
{
    #include "meshQualityDict"
}
mergeTolerance 1e-8;
