openfoam13/FoamPilotCases/Turning35Foundation13/constant/physicalProperties.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class dictionary;
    location "constant";
    object physicalProperties.water;
}
viscosityModel constant;
nu 1.09e-06;
rho 998.8;
