openfoam13/FoamPilotCases/Turning35Foundation13/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class volScalarField;
    location "0";
    object alpha.water;
}
dimensions [0 0 0 0 0 0 0];
internalField uniform 1;
boundaryField
{
    inlet { type fixedValue; value uniform 1; }
    outlet { type inletOutlet; inletValue uniform 1; value uniform 1; }
    sideA { type symmetryPlane; }
    sideB { type symmetryPlane; }
    bottom { type zeroGradient; }
    atmosphere { type inletOutlet; inletValue uniform 0; value uniform 0; }
    hull { type zeroGradient; }
}
