openfoam13/FoamPilotCases/Turning35Foundation13/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class pointVectorField;
    location "0";
    object pointDisplacement;
}
dimensions [0 1 0 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
    inlet { type fixedValue; value uniform (0 0 0); }
    outlet { type fixedValue; value uniform (0 0 0); }
    sideA { type symmetryPlane; }
    sideB { type symmetryPlane; }
    bottom { type fixedValue; value uniform (0 0 0); }
    atmosphere { type fixedValue; value uniform (0 0 0); }
    hull { type calculated; value uniform (0 0 0); }
}
