openfoam13/FoamPilotCases/Turning35Foundation13/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "cellDisplacement.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          0;
        maxIter         200;
    }

    "alpha.water.*"
    {
        nCorrectors     3;
        nSubCycles      1;
        MULESCorr       yes;
        MULES
        {
            nIter 5;
        }
        alphaApplyPrevCorr yes;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
        minIter         1;
    }

    p_rgh
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-9;
        relTol          0.0; // 0.05
    }

    p_rghFinal
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-9;
        relTol          0.0;
    }

    pcorr
    {
        $p_rgh;
        solver          PBiCGStab;
        preconditioner  DIC;
    }

    pcorrFinal
    {
        $pcorr;
    }

    yPsi
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-7; // 1e-5
        relTol          0.0;
    }

    yPsiFinal
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-7; // 1e-5
        relTol          0.0;
    }

    "(U|h)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7; // 1e-6
        relTol          0.0; // 0.1
    }

    "(UFinal|hFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.0;
    }

    "(k|omega|epsilon|kFinal|epsilonFinal|omegaFinal)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7; // 1e-6
        relTol          0.0; // 0.01
    }

    "(rho|rhoFinal)"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-7; // 1e-6
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   true; // recommmeded to switch on for unsteady flow
    nOuterCorrectors    1; // 2 - 5, 1 is identical to PISO
    nCorrectors         3; // at least 2
    nNonOrthogonalCorrectors 1; // at least 1
    oversetAdjustPhi    true; // improve overset mass conservation
    //correctPhi          yes; // has been removed after v2212
    //ddtCorr              false; // has been removed after v2212
    //moveMeshOuterCorrectors yes; This will update the mesh every single outer iteration of the PIMPLE loop
}

relaxationFactors
{

    fields
    {
        ".*"        1;
    }

    equations
    {
        ".*"        1;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
