openfoam13/FoamPilotCases/Turning35Foundation13/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class dictionary;
    location "system";
    object functions;
}
forces
{
    type forces;
    libs ("libforces.so");
    patches (hull);
    CofR (0 0 0);
    writeControl timeStep;
    writeInterval 1;
}
