openfoam13/FoamPilotCases/Turning35Foundation13/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website: https://openfoam.org
    \\  /    A nd           | Version: 13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class dictionary;
    location "system";
    object topoSetDict;
}
actions
(
    {
        name rotor;
        type cellZoneSet;
        action new;
        source boxToCell;
        box (2.55 -0.12 -0.12) (2.78 0.12 0.12);
    }
);
